## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:43" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:43" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:2395ca8effacc6b5ab53eef48949837dafa8100a473ceda560b7c8c12b723760" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a04bd34982e1c7b081b0f24b34f0a142ff215f9b4905cac86903034dfe0ac1cb"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 43 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "941a24008125db82f9a3944a10abe9e9-5" -> "03f26d9515a21efcc51fb0dc9cc27268"
        id                     = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip"
        tags                   = {}
      ~ version_id             = "_.nwwJgSA389_bpvYcaZMVMKRgEPFQu3" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "b08aae30188b2349c62ad4146d6e4e5c-6" -> "f12d747e0b78b872f335428cbff9a31b"
        id                     = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip"
        tags                   = {}
      ~ version_id             = "B2UirDtrmj8zOZv6FPA2CHkddcHZEKUu" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d6e36635e2eb2cb5529a51b6c03f5e6b-6" -> "ab7ea5aab9b2a806dd811147ed23448e"
      ~ id                     = "graphql.cba38e0a7b86146fd8b46e381b65279f.zip" -> (known after apply)
      ~ key                    = "graphql.cba38e0a7b86146fd8b46e381b65279f.zip" -> "graphql.ab7ea5aab9b2a806dd811147ed23448e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "cba38e0a7b86146fd8b46e381b65279f" -> "ab7ea5aab9b2a806dd811147ed23448e"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "M5tiv1bey3m2uCrkC_0okSL7FjF69oHz" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0fcdd68a7ec9c60de02256da6e58f80f" -> "8bffa40620f6f2467f3e4165a1c264ca"
        id                     = "dist/200.html"
      ~ source_hash            = "0fcdd68a7ec9c60de02256da6e58f80f" -> "8bffa40620f6f2467f3e4165a1c264ca"
        tags                   = {}
      ~ version_id             = "5p31tstkMF5IRllzTCsIZ2p6vN.C8fZJ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "725e1a4992db7fa08b19ed06dbd878c4" -> "e18f28229cab78a9781bee1b39906009"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "725e1a4992db7fa08b19ed06dbd878c4" -> "e18f28229cab78a9781bee1b39906009"
        tags                   = {}
      ~ version_id             = "4sgTkhhrC9h2XfH3eCXMBFq34WXCuL7f" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "5f82b7c27711da6a0d474fdfb66cf8e1" -> "e32753d1027a8e3a13fcb6433b38e190"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "5f82b7c27711da6a0d474fdfb66cf8e1" -> "e32753d1027a8e3a13fcb6433b38e190"
        tags                   = {}
      ~ version_id             = "OKcnwTdH2lM8rLmR3lKPwgl7s_iOdt1S" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0fcdd68a7ec9c60de02256da6e58f80f" -> "8bffa40620f6f2467f3e4165a1c264ca"
        id                     = "dist/index.html"
      ~ source_hash            = "0fcdd68a7ec9c60de02256da6e58f80f" -> "8bffa40620f6f2467f3e4165a1c264ca"
        tags                   = {}
      ~ version_id             = "h9u8la_XmlggnMSiejqZvinDmp4FkWDo" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/163.c2ae643e.chunk.js"] will be destroyed
  # (because key ["static/js/163.c2ae643e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f26b70640dedc8dbc4d2e44e83b36fce" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/163.c2ae643e.chunk.js" -> null
-       key                    = "dist/static/js/163.c2ae643e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/163.c2ae643e.chunk.js" -> null
-       source_hash            = "f26b70640dedc8dbc4d2e44e83b36fce" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Zn7PiV9TfFqbHYMHe7KYVbYuZ9ctoe_3" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/163.c2ae643e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/163.c2ae643e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "d6f288673ebf3a5c2244ef822078fc27" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/163.c2ae643e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/163.c2ae643e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/163.c2ae643e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "d6f288673ebf3a5c2244ef822078fc27" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "QM6cZdPJH6k8j_sDC2KuUO3olm3lRxhY" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/163.d4408da2.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "005bf1d9e6f05099b127910a891cfc1f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/163.d4408da2.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/163.d4408da2.chunk.js"
+       source_hash            = "005bf1d9e6f05099b127910a891cfc1f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/163.d4408da2.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "d6f288673ebf3a5c2244ef822078fc27"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/163.d4408da2.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/163.d4408da2.chunk.js.LICENSE.txt"
+       source_hash            = "d6f288673ebf3a5c2244ef822078fc27"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/260.b17c6d57.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ddbe5c2fa9587b94d70f5e7961201082"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/260.b17c6d57.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/260.b17c6d57.chunk.js"
+       source_hash            = "ddbe5c2fa9587b94d70f5e7961201082"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/260.b17c6d57.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "d6f288673ebf3a5c2244ef822078fc27"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/260.b17c6d57.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/260.b17c6d57.chunk.js.LICENSE.txt"
+       source_hash            = "d6f288673ebf3a5c2244ef822078fc27"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/347.cb7a3d10.chunk.js"] will be destroyed
  # (because key ["static/js/347.cb7a3d10.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f0b3bf96733331e45b9c3c98071634ae" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/347.cb7a3d10.chunk.js" -> null
-       key                    = "dist/static/js/347.cb7a3d10.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/347.cb7a3d10.chunk.js" -> null
-       source_hash            = "f0b3bf96733331e45b9c3c98071634ae" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "22qc4oACW0HCL5ff3rlQLDnrzkZCsPhW" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/347.cb7a3d10.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/347.cb7a3d10.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "67b5d8eb6b889161bd650a4d023e825c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/347.cb7a3d10.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/347.cb7a3d10.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/347.cb7a3d10.chunk.js.LICENSE.txt" -> null
-       source_hash            = "67b5d8eb6b889161bd650a4d023e825c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "wuFKpM9j8b0ttNgT7J6PlZUIJhiXMVQI" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.3a6c52eb.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d5e780c2f9d39421ce6746ecaf80ba7d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.3a6c52eb.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.3a6c52eb.chunk.js"
+       source_hash            = "d5e780c2f9d39421ce6746ecaf80ba7d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.3a6c52eb.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.3a6c52eb.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.3a6c52eb.chunk.js.LICENSE.txt"
+       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.c5808a6d.chunk.js"] will be destroyed
  # (because key ["static/js/UserEditUserPage.c5808a6d.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "2e2e55545218b8ee143430ec8f7238c9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.c5808a6d.chunk.js" -> null
-       key                    = "dist/static/js/UserEditUserPage.c5808a6d.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.c5808a6d.chunk.js" -> null
-       source_hash            = "2e2e55545218b8ee143430ec8f7238c9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "i8ooOOWpspwD9ZfdFXcjXK92aBvbVWme" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.c5808a6d.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserEditUserPage.c5808a6d.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "ff55400ddd5e70bd6f6876d992e0d673" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.c5808a6d.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserEditUserPage.c5808a6d.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.c5808a6d.chunk.js.LICENSE.txt" -> null
-       source_hash            = "ff55400ddd5e70bd6f6876d992e0d673" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "BugCo3kJUqvrV0pF5jauu.Etk1ek2eEa" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.52784e16.chunk.js"] will be destroyed
  # (because key ["static/js/UserNewUserPage.52784e16.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "1fea8e4585405b2bc5a445dd6b613b68" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserNewUserPage.52784e16.chunk.js" -> null
-       key                    = "dist/static/js/UserNewUserPage.52784e16.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.52784e16.chunk.js" -> null
-       source_hash            = "1fea8e4585405b2bc5a445dd6b613b68" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "sW_Rbi30TRPs5FAE6z8FKOFimNBEwFft" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.52784e16.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserNewUserPage.52784e16.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b728c86ee719f510e872e2bbc400192a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserNewUserPage.52784e16.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserNewUserPage.52784e16.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.52784e16.chunk.js.LICENSE.txt" -> null
-       source_hash            = "b728c86ee719f510e872e2bbc400192a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "WLy9IkwiQYVeigckXRvpLLsY7X85UYym" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.eaf07e6f.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5219f68e4b3d6124e095d41ba68ea951"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserNewUserPage.eaf07e6f.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.eaf07e6f.chunk.js"
+       source_hash            = "5219f68e4b3d6124e095d41ba68ea951"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.eaf07e6f.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8323bdf2524d967917b1d59b40ac09ac"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserNewUserPage.eaf07e6f.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.eaf07e6f.chunk.js.LICENSE.txt"
+       source_hash            = "8323bdf2524d967917b1d59b40ac09ac"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.669887d6.chunk.js"] will be destroyed
  # (because key ["static/js/UserUsersPage.669887d6.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "0e37388307bcedeec8284b0db245b48b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.669887d6.chunk.js" -> null
-       key                    = "dist/static/js/UserUsersPage.669887d6.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.669887d6.chunk.js" -> null
-       source_hash            = "0e37388307bcedeec8284b0db245b48b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "QQUVqVSfa1W0D8cWtROOi4crrZD2a6ls" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.669887d6.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserUsersPage.669887d6.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.669887d6.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserUsersPage.669887d6.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.669887d6.chunk.js.LICENSE.txt" -> null
-       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "6vl0P64.Hf6BULwT95mUChgceHoWsYxz" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.80c817aa.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d8f1725f33054825ed74028a8031c26b"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.80c817aa.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.80c817aa.chunk.js"
+       source_hash            = "d8f1725f33054825ed74028a8031c26b"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"
+       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b0fc0c41.js"] will be destroyed
  # (because key ["static/js/app.b0fc0c41.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "17830352c823b645b70cbeb98339729d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.b0fc0c41.js" -> null
-       key                    = "dist/static/js/app.b0fc0c41.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b0fc0c41.js" -> null
-       source_hash            = "17830352c823b645b70cbeb98339729d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "sf8GekIVblwlOLoALnNoEXXKtdP1VzkA" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b0fc0c41.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.b0fc0c41.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d38c03ef794fa32760c896577fdf875" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.b0fc0c41.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.b0fc0c41.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b0fc0c41.js.LICENSE.txt" -> null
-       source_hash            = "8d38c03ef794fa32760c896577fdf875" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "FTPDaPzYfG4B081CSgoGvNPWcOElYcHm" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.f64f3cee.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "b5ecf4da3458326feaa1f5c51fb4e702"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.f64f3cee.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.f64f3cee.js"
+       source_hash            = "b5ecf4da3458326feaa1f5c51fb4e702"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.f64f3cee.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9806104531a6dc74425d37448a95fecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.f64f3cee.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.f64f3cee.js.LICENSE.txt"
+       source_hash            = "9806104531a6dc74425d37448a95fecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.7607265f.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "54d27092b3c20f6eeed0e06678b922cc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.7607265f.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.7607265f.js"
+       source_hash            = "54d27092b3c20f6eeed0e06678b922cc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.7c9ddb56.js"] will be destroyed
  # (because key ["static/js/runtime-app.7c9ddb56.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a8e3f4c03318954fce33f38a33d2726a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.7c9ddb56.js" -> null
-       key                    = "dist/static/js/runtime-app.7c9ddb56.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.7c9ddb56.js" -> null
-       source_hash            = "a8e3f4c03318954fce33f38a33d2726a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "FqH7zOF346bN0MGD_JHR7FVau3TJRfRZ" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:12/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "f46d5aaf3435110be5b5cfa9888881e980959a5e" -> "0a4f162f8a71357e1889a6e78aefbfb8207e4b8a"
              ~ "DD_TAGS"                      = "git.commit.sha:f46d5aaf3435110be5b5cfa9888881e980959a5e,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:0a4f162f8a71357e1889a6e78aefbfb8207e4b8a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "f46d5aaf3435110be5b5cfa9888881e980959a5e" -> "0a4f162f8a71357e1889a6e78aefbfb8207e4b8a"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:12/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "f46d5aaf3435110be5b5cfa9888881e980959a5e" -> "0a4f162f8a71357e1889a6e78aefbfb8207e4b8a"
              ~ "DD_TAGS"                      = "git.commit.sha:f46d5aaf3435110be5b5cfa9888881e980959a5e,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:0a4f162f8a71357e1889a6e78aefbfb8207e4b8a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "f46d5aaf3435110be5b5cfa9888881e980959a5e" -> "0a4f162f8a71357e1889a6e78aefbfb8207e4b8a"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-01-27T02:09:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:59" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:59/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.cba38e0a7b86146fd8b46e381b65279f.zip" -> "graphql.ab7ea5aab9b2a806dd811147ed23448e.zip"
        tags                           = {}
      ~ version                        = "59" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "f46d5aaf3435110be5b5cfa9888881e980959a5e" -> "0a4f162f8a71357e1889a6e78aefbfb8207e4b8a"
              ~ "DD_TAGS"                            = "git.commit.sha:f46d5aaf3435110be5b5cfa9888881e980959a5e,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:0a4f162f8a71357e1889a6e78aefbfb8207e4b8a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "f46d5aaf3435110be5b5cfa9888881e980959a5e" -> "0a4f162f8a71357e1889a6e78aefbfb8207e4b8a"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "59" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 18 to add, 10 to change, 18 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7745673709)*